Pandas
==========
Pandas is a powerful tool to manipulate dataframes in Python.  There are many features and examples are listed below.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('~/Desktop/PythonLearning/City_of_Burlington_Property_Details.csv')

In [3]:
# Checks correlation of the dataframe, specify a column in the parenthesis to check against a specific variable
df.corr()

# Display the top 5 rows (including the column names)
df.head(5)

# Lists summary info of datafram including count of non-null elements, data type, memory useage and range index
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10832 entries, 0 to 10831
Data columns (total 38 columns):
AccountNumber            10832 non-null int64
ParcelID                 10832 non-null object
SpanNumber               10832 non-null object
StreetNumber             10827 non-null object
AlternateNumber          1074 non-null object
StreetName               10832 non-null object
Unit                     2076 non-null object
CuO1LastName             10831 non-null object
CuO1FirstName            8519 non-null object
CuO2LastName             5633 non-null object
CuO2FirstName            5107 non-null object
CuO3LastName             572 non-null object
CuO3FirstName            461 non-null object
LandUse                  10832 non-null object
CurrentAcres             10832 non-null float64
TotalGrossArea           10832 non-null int64
FinishedArea             10832 non-null float64
CurrentValue             10832 non-null float64
CurrentLandValue         10832 non-null int64
CurrentYardItemsValue    10832 non-null int64
CurrentBuildingValue     10832 non-null float64
BuildingType             10431 non-null object
HeatFuel                 10339 non-null object
HeatType                 10409 non-null object
Grade                    10431 non-null object
YearBlt                  10832 non-null int64
SaleDate                 4636 non-null object
SalePrice                10832 non-null int64
LegalReference           10832 non-null object
GrantorLastName          4635 non-null object
NumofRooms               10832 non-null int64
NumofBedrooms            10832 non-null int64
Baths                    10832 non-null object
NumofUnits               10832 non-null int64
ZoningCode               10777 non-null object
Foundation               10382 non-null object
Depreciation             10832 non-null float64
PropertyCenterPoint      10615 non-null object
dtypes: float64(5), int64(9), object(24)
memory usage: 3.1+ MB

Numpy
-----------
Quick Mathmatical Functions

In [4]:
# Mathmatical description and statistics of all numerical columns
df.describe()

# Returns a count of not null elements in each column (much like df.info)
df.count()

# Returns a list of numerical columns with total sum
df.sum()

# Returns a list of numerical columns with standard deviation
df.std()

# Returns a list of numerical columns with mean
df.mean()

# Returns a list of numerical columns with median
df.median()

AccountNumber              5538.50000
CurrentAcres                  0.15152
TotalGrossArea             3174.00000
FinishedArea               1602.00000
CurrentValue             236150.00000
CurrentLandValue          91600.00000
CurrentYardItemsValue         0.00000
CurrentBuildingValue     147600.00000
YearBlt                    1950.00000
SalePrice                     0.00000
NumofRooms                    6.00000
NumofBedrooms                 3.00000
NumofUnits                    1.00000
Depreciation                  0.24000
dtype: float64

In [5]:
# List unique values in a DataFrame column
pd.unique(df.NumofUnits.ravel())

array([  0,   1,   2,   4,  13,   3,   6,   5,  19,  44,  37, 123,   7,
        49,   9,  61,  11,  10,   8, 109,  21,  16, 401,  26,  51,  33,
        27,  12,  17,  41,  47, 125,  23,  54,  25, 375,  39, 605,  80,
       112,  42,  52,  24,  55, 462,  14, 140,  15, 161,  20,  18,  76,
       258,  22,  34,  36,  31,  82,  28, 396,  81, 581, 205, 460, 303,
        29, 227, 128,  84, 144, 311, 216,  66, 160,  59,  56,  65, 225,
       117, 338, 220,  43,  35,  40, 908,  30, 679, 150], dtype=int64)

In [6]:
# Convert Series datatype to numeric, getting rid of any non-numeric values
#df['ZoningCode'] = df['ZoningCode'].astype(str).to_numeric()
#df['ZoningCode']

In [7]:
# Grab DataFrame rows where column has certain values
valuelist = ['4']
dfselect = df[df.NumofUnits.isin(valuelist)]
dfselect.head(2)

Empty DataFrame
Columns: [AccountNumber, ParcelID, SpanNumber, StreetNumber, AlternateNumber, StreetName, Unit, CuO1LastName, CuO1FirstName, CuO2LastName, CuO2FirstName, CuO3LastName, CuO3FirstName, LandUse, CurrentAcres, TotalGrossArea, FinishedArea, CurrentValue, CurrentLandValue, CurrentYardItemsValue, CurrentBuildingValue, BuildingType, HeatFuel, HeatType, Grade, YearBlt, SaleDate, SalePrice, LegalReference, GrantorLastName, NumofRooms, NumofBedrooms, Baths, NumofUnits, ZoningCode, Foundation, Depreciation, PropertyCenterPoint]
Index: []

[0 rows x 38 columns]

In [8]:
# Grab DataFrame rows where column doesn't have certain values
valuelist = ['4', '13', '6']
dfnotselect = df[~df.NumofUnits.isin(valuelist)]
dfnotselect.head(2)

,AccountNumber,ParcelID,SpanNumber,StreetNumber,AlternateNumber,StreetName,Unit,CuO1LastName,CuO1FirstName,CuO2LastName,...,LegalReference,GrantorLastName,NumofRooms,NumofBedrooms,Baths,NumofUnits,ZoningCode,Foundation,Depreciation,PropertyCenterPoint
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,0,NaN,0,0,0 / 0,0,DT,NaN,0.0,"(-73.2105, 44.47668)"
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,EMERSON,DEBORAH A,EMERSON,...,0,NaN,6,3,1 / 0,1,NaN,C,0.3,NaN

In [9]:
# Delete column from DataFrame
del df['LegalReference']

In [10]:
# Select from DataFrame using criteria from multiple columns
# (use `|` instead of `&` to do an OR)
newdf = df[(df['NumofRooms']>3) & (df['NumofBedrooms']>2)]
#Check for the reduction of the dataframe
newdf.count()

AccountNumber            6966
ParcelID                 6966
SpanNumber               6966
StreetNumber             6966
AlternateNumber           861
StreetName               6966
Unit                      453
CuO1LastName             6966
CuO1FirstName            5849
CuO2LastName             4125
CuO2FirstName            3839
CuO3LastName              389
CuO3FirstName             319
LandUse                  6966
CurrentAcres             6966
TotalGrossArea           6966
FinishedArea             6966
CurrentValue             6966
CurrentLandValue         6966
CurrentYardItemsValue    6966
CurrentBuildingValue     6966
BuildingType             6966
HeatFuel                 6916
HeatType                 6950
Grade                    6966
YearBlt                  6966
SaleDate                 2949
SalePrice                6966
GrantorLastName          2948
NumofRooms               6966
NumofBedrooms            6966
Baths                    6966
NumofUnits               6966
ZoningCode               6948
Foundation               6949
Depreciation             6966
PropertyCenterPoint      6922
dtype: int64

In [11]:
# Rename several DataFrame columns
df = df.rename(columns = {
    'Baths':'BathsCombined',
    'GrantorLastName':'GrantorName',
})

In [12]:
# Lower-case all DataFrame column names
df.columns = map(str.lower, df.columns)
df.head(1)

,accountnumber,parcelid,spannumber,streetnumber,alternatenumber,streetname,unit,cuo1lastname,cuo1firstname,cuo2lastname,...,saleprice,grantorname,numofrooms,numofbedrooms,bathscombined,numofunits,zoningcode,foundation,depreciation,propertycenterpoint
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,CITY DPW,NaN,NaN,...,0,NaN,0,0,0 / 0,0,DT,NaN,0.0,"(-73.2105, 44.47668)"

Next few examples show how to work with text data in Pandas

In [14]:
# Full list of .str functions: http://pandas.pydata.org/pandas-docs/stable/text.html
# Slice values in a DataFrame column (aka Series)
#df.column.str[0:2]

In [15]:
# Lower-case everything in a DataFrame column
df.cuo1lastname = df.cuo1lastname.str.lower()
df.head(2)

,accountnumber,parcelid,spannumber,streetnumber,alternatenumber,streetname,unit,cuo1lastname,cuo1firstname,cuo2lastname,...,saleprice,grantorname,numofrooms,numofbedrooms,bathscombined,numofunits,zoningcode,foundation,depreciation,propertycenterpoint
0,7502,049-3-187-000,114-035-17502,227,NaN,COLLEGE ST,NaN,city dpw,NaN,NaN,...,0,NaN,0,0,0 / 0,0,DT,NaN,0.0,"(-73.2105, 44.47668)"
1,10680,043-3-085-001,114-035-20680,53,NaN,WARD ST,NaN,emerson,DEBORAH A,EMERSON,...,0,NaN,6,3,1 / 0,1,NaN,C,0.3,NaN

In [23]:
# Get length of data in a DataFrame column
dflen = df.streetnumber.str.len()
dflen.head()

1860    2.0
9583    3.0
3519    3.0
7688    2.0
8857    3.0
Name: streetnumber, dtype: float64

In [17]:
# Sort dataframe by multiple columns, 0 is descending from highest and 1 is ascending from lowest
df = df.sort_values(by=['numofrooms','numofbedrooms','numofunits'],ascending=[0,1,0])

df.head(3)

,accountnumber,parcelid,spannumber,streetnumber,alternatenumber,streetname,unit,cuo1lastname,cuo1firstname,cuo2lastname,...,saleprice,grantorname,numofrooms,numofbedrooms,bathscombined,numofunits,zoningcode,foundation,depreciation,propertycenterpoint
1860,5333,044-4-033-000,114-035-15333,75,NaN,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,0,NaN,605,605,0 / 0,605,D,C,1.0000,"(-73.215, 44.47894)"
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,0,NaN,400,0,11 / 0,20,I,BS,0.3000,"(-73.2063, 44.47431)"
3519,7583,049-4-059-000,114-035-17583,230,NaN,ST PAUL ST,NaN,burlington housing authority,NaN,BHA DECKER TOWERS,...,0,NaN,371,106,161 / 1,161,RM,S,0.2782,"(-73.213, 44.47275)"

In [18]:
# Get top n for each group of columns in a sorted dataframe
# (make sure dataframe is sorted first)
top5 = df.groupby(['numofrooms','numofbedrooms']).head(5)
top5.head()

,accountnumber,parcelid,spannumber,streetnumber,alternatenumber,streetname,unit,cuo1lastname,cuo1firstname,cuo2lastname,...,saleprice,grantorname,numofrooms,numofbedrooms,bathscombined,numofunits,zoningcode,foundation,depreciation,propertycenterpoint
1860,5333,044-4-033-000,114-035-15333,75,NaN,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,0,NaN,605,605,0 / 0,605,D,C,1.0000,"(-73.215, 44.47894)"
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,0,NaN,400,0,11 / 0,20,I,BS,0.3000,"(-73.2063, 44.47431)"
3519,7583,049-4-059-000,114-035-17583,230,NaN,ST PAUL ST,NaN,burlington housing authority,NaN,BHA DECKER TOWERS,...,0,NaN,371,106,161 / 1,161,RM,S,0.2782,"(-73.213, 44.47275)"
7688,7249,049-3-023-001,114-035-17249,80,NaN,ST PAUL ST,NaN,burlington savings bank,NaN,NaN,...,0,NaN,311,0,0 / 0,311,D,S,0.2775,"(-73.2135, 44.47762)"
8857,7856,050-1-051-000,114-035-17856,227,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,0,NaN,289,0,8 / 2,25,I,BS,0.3000,"(-73.2057, 44.47373)"

In [19]:
# Grab DataFrame rows where specific column notnull
notnulldf = df[df['alternatenumber'].notnull()]
notnulldf.head(3)

,accountnumber,parcelid,spannumber,streetnumber,alternatenumber,streetname,unit,cuo1lastname,cuo1firstname,cuo2lastname,...,saleprice,grantorname,numofrooms,numofbedrooms,bathscombined,numofunits,zoningcode,foundation,depreciation,propertycenterpoint
899,4881,044-2-019-000,114-035-14881,10,20,NORTH CHAMPLAIN ST,NaN,burlington housing authority,NaN,NaN,...,0,NaN,158,56,51 / 1,51,DT,S,0.228,"(-73.217, 44.48069)"
6547,11093,044-2-147-001,114-035-52634,41,55,CHERRY ST,NaN,41 cherry street llc,NaN,NaN,...,0,NaN,127,127,128 / 4,128,D,C,0.000,NaN
7484,4885,044-2-023-000,114-035-14885,80,90,PEARL ST,NaN,bove,RICHARD J,BOVE,...,0,NaN,123,54,34 / 8,34,DT,C,0.018,"(-73.2157, 44.48059)"

In [20]:
# Grab DataFrame rows where specific column is null
nulldf = df[df['alternatenumber'].isnull()]
nulldf.head(3)

,accountnumber,parcelid,spannumber,streetnumber,alternatenumber,streetname,unit,cuo1lastname,cuo1firstname,cuo2lastname,...,saleprice,grantorname,numofrooms,numofbedrooms,bathscombined,numofunits,zoningcode,foundation,depreciation,propertycenterpoint
1860,5333,044-4-033-000,114-035-15333,75,NaN,CHERRY ST,NaN,"btc mall associates, llc",NaN,NaN,...,0,NaN,605,605,0 / 0,605,D,C,1.0000,"(-73.215, 44.47894)"
9583,7871,050-1-066-000,114-035-17871,225,NaN,SOUTH WILLARD ST,NaN,champlain college inc.,NaN,NaN,...,0,NaN,400,0,11 / 0,20,I,BS,0.3000,"(-73.2063, 44.47431)"
3519,7583,049-4-059-000,114-035-17583,230,NaN,ST PAUL ST,NaN,burlington housing authority,NaN,BHA DECKER TOWERS,...,0,NaN,371,106,161 / 1,161,RM,S,0.2782,"(-73.213, 44.47275)"

Everything Below IS IN PROGRESS
=================

In [21]:
# Even more fancy DataFrame column re-naming
# lower-case all DataFrame column names (for example)
df.rename(columns=lambda x: x.split('.')[-1], inplace=True)
# Loop through rows in a DataFrame
# (if you must)
for index, row in df.iterrows():
    print index, row['some column']

SyntaxError: Missing parentheses in call to 'print' (<ipython-input-21-a249cdb35683>, line 7)

In [ ]:
# Select from DataFrame using multiple keys of a hierarchical index
#df.xs(('index level 1 value','index level 2 value'), level=('level 1','level 2'))

In [ ]:
# Change all NaNs to None (useful before loading to a db)
#df = df.where((pd.notnull(df)), None)
df.head(3)

In [ ]:
# Get quick count of rows in a DataFrame
len(df.index)

In [ ]:
# Pivot data (with flexibility about what what
# becomes a column and what stays a row)
# Syntax works on Pandas >= .14
#pd.pivot_table(
#  df,values='cell_value',
#  index=['col1', 'col2', 'col3'], #these stay as columns; will fail silently if any of these cols have null values
#  columns=['col4']) #data values in this column become their own column

In [ ]:
# Change data type of DataFrame column
df.column_name = df.column_name.astype(np.int64)

In [ ]:
# Set DataFrame column values based on other column values (h/t: @mlevkov)
df.loc[(df['column1'] == some_value) & (df['column2'] == some_other_value), ['column_to_change']] = new_value

In [ ]:
# Clean up missing values in multiple DataFrame columns
df = df.fillna({
    'col1': 'missing',
    'col2': '99.999',
    'col3': '999',
    'col4': 'missing',
    'col5': 'missing',
    'col6': '99'
})

In [ ]:
# Concatenate two DataFrame columns into a new, single column
# (useful when dealing with composite keys, for example)
#df['newcol'] = df['col1'].map(str) + df['col2'].map(str)

In [ ]:
# Doing calculations with DataFrame columns that have missing values
# In example below, swap in 0 for df['col1'] cells that contain null
df['new_col'] = np.where(pd.isnull(df['col1']),0,df['col1']) + df['col2']

In [ ]:
# Split delimited values in a DataFrame column into two new columns
df['new_col1'], df['new_col2'] = zip(*df['original_col'].apply(lambda x: x.split(': ', 1)))

In [ ]:
# Get rid of non-numeric values throughout a DataFrame:
for col in refunds.columns.values:
  refunds[col] = refunds[col].replace('[^0-9]+.-', '', regex=True)

In [ ]:
# Collapse hierarchical column indexes
df.columns = df.columns.get_level_values(0)

In [ ]:
# Convert Django queryset to DataFrame
qs = DjangoModelName.objects.all()
q = qs.values()
df = pd.DataFrame.from_records(q)

In [ ]:
# Create a DataFrame from a Python dictionary
df = pd.DataFrame(list(a_dictionary.items()), columns = ['column1', 'column2'])

In [ ]:
# Get a report of all duplicate records in a dataframe, based on specific columns
dupes = df[df.duplicated(['col1', 'col2', 'col3'], keep=False)]

In [ ]:
# Set up formatting so larger numbers aren't displayed in scientific notation (h/t @thecapacity)
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [ ]:
wholedf['Date'] = pd.to_datetime(wholedf['Date'])